---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsEnabled
source: html/184cbd95-aaaf-e9ab-ecb4-07a065cd51f4.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsEnabled Property

Identifies if any segment length dimensions will be shown or not.

## Syntax (C#)
```csharp
public bool SegmentLengthDimensionsEnabled { get; set; }
```